In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
data=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|',index_col='user_id')

In [ ]:
data.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [ ]:
data.shape

(943, 4)

In [ ]:
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [ ]:
data.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

Data Type of Each Column

In [ ]:
data.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

Print Only Occupation Column

In [ ]:
data.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

Different Types Of Occupation

In [ ]:
data.occupation.nunique()

#or
data.occupation.value_counts().count()

21

What is the Most Frequent Occupation

In [ ]:
data.occupation.value_counts().head(1).index[0]

'student'

summarize The data Frame

In [ ]:
data.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [ ]:
data.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

Summarize Only specific Column

In [ ]:
data.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

Mean Age Of Users

In [ ]:
round(data.age.mean())

34

Age With Least Occurence

In [ ]:
data.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64